<template>
    <div>
        <LoanDetail 
        v-for="(list, idx) in lists" 
        :list="list"
        :key="idx"
        />
    </div>
</template>

<script>
import LoanDetail from "./LoanDetail.vue"

export default {
    name: "LoanList",
    components: {
        LoanDetail,
    },
    data() {
        return {
            lists : [
                {
                    name: "버팀목 전세자금대출",
                    bank: "KB국민은행",
                    term: "2년",
                    features: ["부부합산 총소득이 5천만원 이하인 고객에게 임차보증금의 70%이내에서 최고 1억2천만원까지 지원",
                    "부부합산 총소득이 6천만원 이하인 신혼가구에 임차보증금의 80%이내에서 최고 2억원까지 지원",
                    "부부합산 총소득이 6천만원 이하인 2자녀(미성년자) 이상인 가구에 임차보증금의 80%이내에서 최고 2억 2천만원까지 지원"
                    ],
                    condition: "임차전용면적 85㎡(수도권을 제외한 도시지역이 아닌 읍 또는 면지역 100㎡)이하 주택 또는 주거용 오피스텔(85㎡ 이하)"
                },{
                    name: "중소기업 취업청년 버팀목전세자금대출",
                    bank: "KB국민은행",
                    term: "2년",
                    features: ["중소기업 또는 중견기업에 재직하거나, 중소벤처기업진흥공단,신용보증기금,기술보증기금으로부터 보증 또는 창업자금을 지원받은 청년 가구에 대해 임차보증금의 100% 이내(한국주택금융공사 주택금융신용보증서인 경우 80% 이내)에서 최대 1억원까지 지원"],
                    condition: "임차 전용면적 85㎡ 이하, 임차보증금 2억원 이하 주택(주거용오피스텔 포함)"
                },{
                    name: "버팀목 전세자금대출",
                    bank: "KB국민은행",
                    term: "2년",
                    features: ["부부합산 총소득이 5천만원 이하인 고객에게 임차보증금의 70%이내에서 최고 1억2천만원까지 지원",
                    "부부합산 총소득이 6천만원 이하인 신혼가구에 임차보증금의 80%이내에서 최고 2억원까지 지원",
                    "부부합산 총소득이 6천만원 이하인 2자녀(미성년자) 이상인 가구에 임차보증금의 80%이내에서 최고 2억 2천만원까지 지원"
                    ],
                    condition: ""
                },
            ]
        }
    }

}
</script>

<style>

</style>